app/controllers/comments_controller.rb

    def create
        @expense=Expense.find(comment_params[:expense_id])
        @comment=@expense.comments.new(comment_params)
        #@comment = Comment.new(db_params)
        @comment.save!
        if !reply_flag_param[:reply_flag]
            ExpenseMailer.with(user: Employee.find(@expense.employee_id).email_id, email_body: "the comment sent by admin is #{comment_params[:body]}").expense_report_mail.deliver_later
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("created_at", "updated_at", "title", "body", "expense_id") VALUES (?, ?, ?, ?, ?)
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]