app/controllers/employees_controller.rb

INSERT INTO "employees" ("phone_no", "employee_name", "email_id", "employee_department", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        employee_details=employee_params
        employee_details[:status]="onboarded"
        @employee=Employee.new(employee_details)
       if  @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT 1 AS one FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "employees" SET "status" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["status", "terminated"], ["updated_at", "2022-04-22 12:39:28.814675"], ["id", 11]]
---
    def update
        @employee = Employee.find(params[:id])
        employee_params.each do |key,value|
            @employee.update!(key => value) if value!=nil && !value.blank?

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def update_status
        @employee=Employee.find(params[:id])