app/controllers/expenses_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
INSERT INTO "expenses" ("invoice_id", "date", "discription", "amount", "employee_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @employee = Employee.find(params[:employee_id])
        expense_details=expense_params
        expense_details[:status]="pending"
        @expense=@employee.expenses.new(expense_details)
        if @expense.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."employee_id" = ?  [["employee_id", 11]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."invoice_id" = ? ORDER BY "expenses"."id" ASC LIMIT ?  [["invoice_id", "2"], ["LIMIT", 1]]
UPDATE "expenses" SET "updated_at" = ?, "status" = ? WHERE "expenses"."id" = ?  [["updated_at", "2022-04-19 05:29:16.296224"], ["status", "rejected"], ["id", 2]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."employee_id" = ?  [["employee_id", 13]]
UPDATE "expenses" SET "updated_at" = ?, "status" = ? WHERE "expenses"."id" = ?  [["updated_at", "2022-04-25 06:06:35.573118"], ["status", "approved"], ["id", 5]]
---
    def validate

        @employee=Employee.find(params[:id])
        if @employee.status=="onboarded"

            @employee.expenses.each do |expense|
                puts "the invoice id is #{expense[:invoice_id]}"
                expense_data=Expense.where(:invoice_id => expense[:invoice_id]).first

                if validate_invoice(expense[:invoice_id])
                    expense_data.update!(status: "approved")
                    ExpenseMailer.with(user: @employee.email_id, email_body: "the applied expense amount is #{expense[:amount]} vs the approved expense amount is #{expense[:amount]}").expense_report_mail.deliver_later
                else
                    expense_data.update!(status: "rejected")
                    ExpenseMailer.with(user: @employee.email_id, email_body: "the applied expense amount is #{expense[:amount]} is got rejected").expense_report_mail.deliver_later