app/controllers/expenses_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def set_employee
        @employee = Employee.find(params[:employee_id])