app/controllers/concerns/employee_module.rb

        def destroy
            if Employee.exists?(params[:id])
            @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

        def expense_report(employee_id)
            if Employee.exists?(employee_id)
                @employee=Employee.find(employee_id)
                expenses_json=[]
                @employee.expenses.each do |expense|
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."employee_id" = ?  [["employee_id", 13]]